open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_aud.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/* BK7258 analog audio (AUD) chip-level driver.
 *
 * Adapted from workspace ref264/board/beken/chips/bk7258. Measurement
 * notes below belong to that reference, not to this firmware's board test.
 * This integration is limited to serialized 16 kHz mono diagnostics.
 *
 * This is a port of the register sequences in
 *
 *   bk_avdk_smp/ap/middleware/driver/audio/aud/aud_common_driver.c
 *   bk_avdk_smp/ap/middleware/driver/audio/aud/aud_dac_driver.c
 *   bk_avdk_smp/ap/middleware/driver/audio/aud/aud_adc_driver.c
 *
 * with the vendor's sys_drv_aud_*() / sys_hal_aud_*() indirection folded
 * into direct register access (see hardware/bk7258_aud.h for the
 * field-by-field provenance of every offset and bit used here).
 *
 * Three things differ from the vendor implementation and are deliberate:
 *
 * 1. Power and module clock come from CP1.  The vendor calls
 *    bk_pm_module_vote_power_ctrl()/bk_pm_clock_ctrl() directly because
 *    its audio driver runs on the core that owns the PMU.  This AP image
 *    does not, so the same two votes are sent over the PWC mailbox
 *    channel, exactly as bk7258_pwm.c does for the PWM module clock.
 *    Watch the polarity: the power command's "on" value is 0
 *    (PM_POWER_MODULE_STATE_ON) while the clock command's "up" value is 1
 *    (PM_CLK_CTRL_PWR_UP).  They are opposite.
 *
 * 2. MIC2 is enabled by writing ana_reg27 directly.  The vendor's
 *    sys_hal_aud_mic2_en() is an explicit "//not support" stub on BK7258
 *    (sys_hal.c:1939-1942); the only reason MIC2 works in the vendor
 *    stack at all is that bk_aud_driver_init() writes the constant
 *    0x91800006 to ana_reg27, whose bit 28 is micen.  This driver keeps
 *    that behaviour but makes it explicit and optional.
 *
 * 3. Analog register writes go through aud_ana_write(), which polls the
 *    analog-SPI busy bit after each write.  A bare putreg32() to these
 *    registers is silently unreliable -- see hardware/bk7258_aud.h.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <debug.h>
#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>

#include "arm_internal.h"
#include "irq.h"
#include "bk7258_aud.h"
#include "hardware/bk7258_aud.h"
#include "hardware/bk7258_mbox.h"
#include "hardware/bk7258_sysctrl.h"

#ifdef CONFIG_BK7258_AUDIO

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PWC mailbox commands and parameters.
 *
 * Command numbers: bk_avdk_smp/cp/include/driver/pwr_clk.h:25-26.
 * The CP forwards param1/param2 verbatim to bk_pm_module_vote_power_ctrl()
 * and bk_pm_clock_ctrl() (cp/middleware/driver/pwr_clk/pwr_clk.c:206-210
 * -> low_pwr_core.c:222-231).
 *
 * AUDP_AUDIO sub power domain id: POWER_MODULE_NAME_AUDP (6) *
 * PM_MODULE_SUB_POWER_DOMAIN_MAX (20) + 2 == 122, from
 * cp/middleware/soc/bk7258/hal/sys_types.h:326,372-376 and :145.  Passing
 * a *sub* domain to the power command is the vendor's own usage
 * (aud_common_driver.c:359 uses PM_POWER_SUB_MODULE_NAME_AUDP_AUDIO, and
 * i2s_driver.c:146 / psram_hal.c:427 do the same for their sub domains)
 * even though the prototype names the top-level enum.
 *
 * AUD module clock id: PM_CLK_ID_AUDIO == 30, from
 * cp/include/modules/pm.h:285.  Note this is pm_dev_clk_e and NOT the
 * sub-power-domain numbering used by the power command.
 */

#define AUD_PM_POWER_CTRL_CMD      0x1u
#define AUD_PM_CLK_CTRL_CMD        0x2u

#define AUD_PM_SUBDOMAIN_AUDP_AUDIO 122u
#define AUD_PM_CLK_ID_AUDIO         30u

#define AUD_PM_POWER_STATE_ON       0u   /* PM_POWER_MODULE_STATE_ON  */
#define AUD_PM_POWER_STATE_OFF      1u   /* PM_POWER_MODULE_STATE_OFF */
#define AUD_PM_CLK_PWR_DOWN         0u   /* PM_CLK_CTRL_PWR_DOWN      */
#define AUD_PM_CLK_PWR_UP           1u   /* PM_CLK_CTRL_PWR_UP        */

/* PWC only enqueues the request; it does not consume CP1's ACK yet (see
 * the comment in bk7258_motor.c around its own vote).  Until it does, the
 * only way to let CP1 act on the votes is to wait.  bk7258_motor.c uses
 * 20 ms for the PWM clock gate; the audio path additionally has to bring
 * up a power domain, so allow more and then verify by reading the block's
 * device ID.
 */

#define AUD_PM_SETTLE_US            30000

/* Timeout handed to bk7258_mailbox_wait_pwc() after each vote, matching
 * PM_TRANSPORT_TIMEOUT_MS in bk7258_pm_pwc.c.  This bounds the wait for
 * the PWC channel to drain; it is not a wait for CP1 to have acted on the
 * request, which PWC does not yet report.
 */

#define AUD_PM_TRANSPORT_TIMEOUT_MS 500

/* Number of aud_ana_write() busy-poll iterations before giving up.  The
 * analog SPI link runs at a fixed divider off the system clock and the
 * vendor's sys_ll_set_analog_reg_value() spins unbounded; bound it here so
 * a mis-configured clock cannot hang bring-up.
 */

#define AUD_ANA_POLL_LIMIT          100000

/* FIFO service thresholds, in samples.  The DAC left FIFO raises its
 * interrupt once the fill level drops below DACL_RD_THRED, the ADC FIFO
 * once it rises above ADC_WR_THRED.  Both fields are 5 bits wide.
 * v23 observed ADC FIFO_FULL on every IRQ at threshold 16. Do not infer
 * FIFO capacity from the width of the threshold field: request capture
 * service earlier. Leave the hardware-verified playback setting unchanged.
 */

#define AUD_DACL_RD_THRESHOLD       16u
#define AUD_ADC_WR_THRESHOLD        4u

/* A plausible AUD_DEVICE_ID must be neither all-zeroes (block held in
 * reset or unclocked) nor all-ones (bus returning a floating value).
 */

