open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
#define AUD_ID_IS_VALID(id)         ((id) != 0u && (id) != 0xffffffffu)

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool g_aud_initialized;
static bool g_aud_dac_ready;
static bool g_aud_adc_ready;
static bool g_aud_irq_attached;
static const void *g_aud_owner;

/* Per-direction callbacks.
 *
 * These must be registered independently, each with its own argument.  An
 * earlier version used a single set_callbacks(tx, rx, arg) entry point with
 * one shared argument, which had two consequences on hardware:
 *
 *   - Starting playback after capture overwrote the rx callback with NULL,
 *     so the ISR found the ADC flag set with nothing to service it and
 *     masked ADC_INT_EN as a safety measure.  Capture then stopped for
 *     good.  Simultaneous play+capture reported zero buffers and zero
 *     samples while capture alone worked.
 *   - Both callbacks were handed the same argument, so with both
 *     directions active one of them would receive the other direction's
 *     instance pointer.
 */

static bk7258_aud_xfer_cb_t g_aud_tx_cb;
static void *g_aud_tx_arg;
static bk7258_aud_xfer_cb_t g_aud_rx_cb;
static void *g_aud_rx_arg;

/* Mirrors of the last programmed capture geometry, needed because the
 * ADC FIFO port always presents both halves and the reader has to know
 * whether the right half is meaningful.
 */

static bool g_aud_capture_reference;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: aud_ana_write
 *
 * Description:
 *   Write one analog register and wait for the analog-SPI shadow transfer
 *   to retire, mirroring sys_ll_set_analog_reg_value() in
 *   bk_avdk_smp/ap/middleware/soc/bk7258_ap/hal/sys_ll.h:51-59.
 *
 ****************************************************************************/

static int aud_ana_write(unsigned int reg, uint32_t value)
{
  uint32_t limit = AUD_ANA_POLL_LIMIT;

  putreg32(value, BK7258_ANA_REG(reg));

  while ((getreg32(BK7258_ANA_SPI_STATE) & BK7258_ANA_SPI_BUSY(reg)) != 0)
    {
      if (limit-- == 0)
        {
          return -ETIMEDOUT;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: aud_ana_modify
 *
 * Description:
 *   Read-modify-write one analog register.  The read side is a plain
 *   register read (the shadow is readable directly, see
 *   sys_ll_get_analog_reg_value()); only the write needs the poll.
 *
 ****************************************************************************/

static int aud_ana_modify(unsigned int reg, uint32_t clrbits,
                          uint32_t setbits)
{
  uint32_t value = getreg32(BK7258_ANA_REG(reg));

  value &= ~clrbits;
  value |= setbits;

  return aud_ana_write(reg, value);
}

/****************************************************************************
 * Name: aud_pwc_request
 *
 * Description:
 *   Ask CP1 for the AUDP_AUDIO power domain and the AUD module clock.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: aud_pwc_send
 *
 * Description:
 *   Send one PWC request and wait for the channel to drain.
 *
 *   The wait is mandatory, not an optimisation: the PWC logical channel
 *   holds exactly one in-flight message, and bk7258_mailbox_send_wire()
 *   rejects a second one with -EBUSY while the first is still queued
 *   (bk7258_mailbox_channel.c:931-935).  bk7258_pm_pwc.c pairs every
 *   bk7258_mailbox_send_pwc() with bk7258_mailbox_wait_pwc() for the same
 *   reason; bk7258_pwm.c gets away without it only because the motor needs
 *   a single vote.
 *
 *   The first version of this driver sent the AUDP power vote and the AUD
 *   clock vote back to back and failed on hardware with
 *   "AUD block bring-up failed, error=-16".
 *
 ****************************************************************************/

static int aud_pwc_send(uint8_t command, uint32_t p1, uint32_t p2)
{
  int ret = bk7258_mailbox_send_pwc(command, p1, p2, 0);

  if (ret >= 0)
    {
      ret = bk7258_mailbox_wait_pwc(AUD_PM_TRANSPORT_TIMEOUT_MS);
    }

  return ret;
}

static int aud_pwc_request(bool enable)
{
  int ret;

  if (enable)
    {
      ret = aud_pwc_send(AUD_PM_POWER_CTRL_CMD,
                         AUD_PM_SUBDOMAIN_AUDP_AUDIO,
                         AUD_PM_POWER_STATE_ON);
      if (ret < 0)
        {
          auderr("AUDP power vote failed: %d\n", ret);
          return ret;
        }

      ret = aud_pwc_send(AUD_PM_CLK_CTRL_CMD, AUD_PM_CLK_ID_AUDIO,
                         AUD_PM_CLK_PWR_UP);
      if (ret < 0)
        {
          auderr("AUD clock vote failed: %d\n", ret);
          return ret;
        }
    }
  else
    {
      (void)aud_pwc_send(AUD_PM_CLK_CTRL_CMD, AUD_PM_CLK_ID_AUDIO,
                         AUD_PM_CLK_PWR_DOWN);
      (void)aud_pwc_send(AUD_PM_POWER_CTRL_CMD,
                         AUD_PM_SUBDOMAIN_AUDP_AUDIO,
                         AUD_PM_POWER_STATE_OFF);
      return OK;
    }

  /* PWC does not yet surface CP1's ACK, so fall back to a settle delay
   * followed by a positive readback check.
   */

  nxsig_usleep(AUD_PM_SETTLE_US);
  return OK;
}

/****************************************************************************
 * Name: aud_clk_config
 *
 * Description:
 *   Select the audio master clock, following bk_aud_clk_config() in
 *   aud_common_driver.c:316-342.
 *
 ****************************************************************************/

static int aud_clk_config(enum bk7258_aud_clksrc clksrc)
{
  if (clksrc == BK7258_AUD_CLK_APLL)
    {
      /* The APLL path additionally needs sys_drv_apll_en(),
       * sys_drv_apll_cal_val_set(0x8973CA6F or 0x88AF2EC9 for the 44.1k
       * family), sys_drv_apll_config_set(0xC2A0AE86) and a
       * sys_drv_apll_spi_trigger_set() 1-delay-0 pulse
       * (aud_common_driver.c:319-329 and the per-rate recalibration in
       * aud_dac_driver.c:184-199).  Those registers have not been
       * transcribed into hardware/bk7258_aud.h yet, and guessing them
       * would be exactly the kind of unverified register write this port
       * is trying to avoid.  XTAL covers 8k/16k/32k, which is what the
       * bring-up sequence needs; reject APLL explicitly rather than
       * silently running at the wrong rate.
       */

      return -ENOTSUP;
    }

