open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
  /* XTAL: cksel_aud = 0 in SYSCTRL and apll_sel = 0 in AUD_CONFIG. */

  /* CP owns the shared clock register; do not race its updates. */

  if ((getreg32(BK7258_SYS_CLKDIV1) & BK7258_SYS_CKSEL_AUD) != 0)
    {
      return -ENOTSUP;
    }

  modifyreg32(BK7258_AUD_CONFIG, BK7258_AUD_APLL_SEL, 0);

  return OK;
}

/****************************************************************************
 * Name: aud_set_dac_samplerate / aud_set_adc_samplerate
 *
 * Description:
 *   Program the sample-rate field and, for rates that are not one of the
 *   four natively encoded ones, the fractional-modulus divider.
 *
 *   These two functions intentionally do NOT share a table: the vendor
 *   scales the fractional constants differently for the two directions
 *   and the asymmetry is preserved verbatim.  Compare
 *   aud_dac_driver.c:201-227 with aud_adc_driver.c:190-241:
 *
 *     rate    DAC fracmod              ADC fracmod          rate field
 *     11025   CONST_DIV_44_1K << 2     CONST_DIV_44_1K      2 / 2
 *     12000   CONST_DIV_48K   << 2     CONST_DIV_48K        3 / 3
 *     22050   CONST_DIV_44_1K << 1     CONST_DIV_44_1K >> 1 2 / 2
 *     24000   CONST_DIV_48K   << 1     CONST_DIV_48K   >> 1 3 / 3
 *     32000   CONST_DIV_16K   >> 1     CONST_DIV_32K        1 / 3
 *
 ****************************************************************************/

static int aud_set_dac_samplerate(uint32_t samplerate)
{
  uint32_t fracmod = 0;
  uint32_t field;
  bool manual = true;

  switch (samplerate)
    {
      case 8000:
        field = BK7258_AUD_SAMP_RATE_8K;
        manual = false;
        break;

      case 16000:
        field = BK7258_AUD_SAMP_RATE_16K;
        manual = false;
        break;

      case 44100:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        manual = false;
        break;

      case 48000:
        field = BK7258_AUD_SAMP_RATE_48K;
        manual = false;
        break;

      case 11025:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_FRACMOD_44_1K << 2;
        break;

      case 12000:
        field = BK7258_AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_FRACMOD_48K << 2;
        break;

      case 22050:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_FRACMOD_44_1K << 1;
        break;

      case 24000:
        field = BK7258_AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_FRACMOD_48K << 1;
        break;

      case 32000:
        field = BK7258_AUD_SAMP_RATE_16K;
        fracmod = BK7258_AUD_FRACMOD_16K >> 1;
        break;

      default:
        return -EINVAL;
    }

  /* Clear the manual bit first so a previous rate's divider cannot leak
   * into a natively encoded rate (aud_dac_driver.c:201 does the same).
   */

  modifyreg32(BK7258_AUD_EXTEND_CFG, BK7258_AUD_DAC_FRACMOD_MANUAL, 0);

  if (manual)
    {
      putreg32(fracmod, BK7258_AUD_DAC_FRACMOD);
      modifyreg32(BK7258_AUD_EXTEND_CFG, 0, BK7258_AUD_DAC_FRACMOD_MANUAL);
    }

  modifyreg32(BK7258_AUD_CONFIG, BK7258_AUD_SAMP_RATE_DAC_MASK,
              field << BK7258_AUD_SAMP_RATE_DAC_SHIFT);

  return OK;
}

static int aud_set_adc_samplerate(uint32_t samplerate)
{
  uint32_t fracmod = 0;
  uint32_t field;
  bool manual = true;

  switch (samplerate)
    {
      case 8000:
        field = BK7258_AUD_SAMP_RATE_8K;
        manual = false;
        break;

      case 16000:
        field = BK7258_AUD_SAMP_RATE_16K;
        manual = false;
        break;

      case 44100:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        manual = false;
        break;

      case 48000:
        field = BK7258_AUD_SAMP_RATE_48K;
        manual = false;
        break;

      case 11025:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_FRACMOD_44_1K;
        break;

      case 12000:
        field = BK7258_AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_FRACMOD_48K;
        break;

      case 22050:
        field = BK7258_AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_FRACMOD_44_1K >> 1;
        break;

      case 24000:
        field = BK7258_AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_FRACMOD_48K >> 1;
        break;

      case 32000:
        field = BK7258_AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_FRACMOD_32K;
        break;

      default:
        return -EINVAL;
    }

  modifyreg32(BK7258_AUD_EXTEND_CFG, BK7258_AUD_ADC_FRACMOD_MANUAL, 0);

  if (manual)
    {
      putreg32(fracmod, BK7258_AUD_ADC_FRACMOD);
      modifyreg32(BK7258_AUD_EXTEND_CFG, 0, BK7258_AUD_ADC_FRACMOD_MANUAL);
    }

  modifyreg32(BK7258_AUD_CONFIG, BK7258_AUD_SAMP_RATE_ADC_MASK,
              field << BK7258_AUD_SAMP_RATE_ADC_SHIFT);

  return OK;
}

/****************************************************************************
 * Name: bk7258_aud_isr
 *
 * Description:
 *   AUD FIFO interrupt.  The block reports DAC-left and ADC conditions in
 *   the same status word (REG_0x0E) and shares one interrupt line, so
 *   dispatch on the individual flags.
 *
 ****************************************************************************/

static int bk7258_aud_isr(int irq, void *context, void *arg)
{
  uint32_t status = getreg32(BK7258_AUD_FIFO_STATUS);

  (void)irq;
  (void)context;
  (void)arg;

  if ((status & BK7258_AUD_DACL_INT_FLAG) != 0 && g_aud_tx_cb != NULL)
    {
      g_aud_tx_cb(g_aud_tx_arg);
    }

  if ((status & BK7258_AUD_ADC_INT_FLAG) != 0 && g_aud_rx_cb != NULL)
    {
      g_aud_rx_cb(g_aud_rx_arg);
    }

  /* The flags are cleared by servicing the corresponding FIFO (draining
   * the ADC below its threshold, refilling the DAC above its threshold).
   * If a callback is missing, mask that direction instead of spinning in
   * the ISR forever.
   */

  if ((status & BK7258_AUD_DACL_INT_FLAG) != 0 && g_aud_tx_cb == NULL)
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_DACL_INT_EN, 0);
    }

  if ((status & BK7258_AUD_ADC_INT_FLAG) != 0 && g_aud_rx_cb == NULL)
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_ADC_INT_EN, 0);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_aud_initialize
 ****************************************************************************/

int bk7258_aud_initialize(void)
{
  irqstate_t flags;
  uint32_t id;
  int ret;

  if (g_aud_initialized)
    {
      return OK;
    }

  /* Power domain and module clock first: every register below lives in
   * the AUDP domain or in the analog block it feeds.
   */

  ret = aud_pwc_request(true);
  if (ret < 0)
    {
      auderr("AUDP power/clock vote failed: %d\n", ret);
      return ret;
    }

