open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
  id = getreg32(BK7258_AUD_DEVICE_ID);
  if (!AUD_ID_IS_VALID(id))
    {
      auderr("AUD block unreachable, device id=0x%08" PRIx32 "\n", id);
      (void)aud_pwc_request(false);
      return -ENODEV;
    }

  /* Default to the crystal so the block has a valid clock before any
   * analog configuration.  Callers that need 44.1k/48k accuracy select
   * APLL later via *_setup().
   */

  ret = aud_clk_config(BK7258_AUD_CLK_XTAL);
  if (ret < 0)
    {
      (void)aud_pwc_request(false);
      return ret;
    }

  /* AUD_CLK_CONTROL must be left with BOTH bits asserted.
   *
   * This was established by experiment on hardware, because the vendor
   * sources describe bit0 in a way that contradicts how it behaves.
   * aud_ll_macro_def.h:83 calls REG_0x02[0] a soft reset and says
   * "software must clear it", so an earlier version of this driver pulsed
   * it (set, delay, clear).  With that sequence every other register read
   * back correctly and yet the ADC produced nothing at all -- the FIFO
   * stayed in ADC_FIFO_EMPTY and even a polled read returned zero samples.
   *
   * Sweeping all four combinations at 16 kHz stereo, polling for 200 ms
   * each (expected sample count 16000 * 2 * 0.2 = 6400):
   *
   *   clkctl=0  rst=0 gate=0 ->    0 samples
   *   clkctl=1  rst=1 gate=0 -> 4760 samples, mean square 6797105
   *   clkctl=2  rst=0 gate=1 ->    0 samples
   *   clkctl=3  rst=1 gate=1 -> 6400 samples, mean square 9565
   *
   * So bit0 behaves as a release that must stay asserted, not as a pulse:
   * clearing it holds the ADC in reset.  bit1 additionally has to be set
   * for the sample rate to be correct -- with it clear the capture is 26 %
   * short and the mean square is three orders of magnitude higher, i.e.
   * samples are being dropped and corrupted rather than merely attenuated.
   * clkctl=3 hits the expected sample count exactly.
   *
   * The vendor's bk_aud_driver_init() (aud_common_driver.c:375) sets bit0
   * and never clears it, which is consistent with this result.
   */

  putreg32(BK7258_AUD_ADC_SOFT_RESET | BK7258_AUD_ADC_CLK_GATE,
           BK7258_AUD_CLK_CONTROL);
  up_udelay(100);

  /* Load the analog block's reset values, then enable the audio bias.
   * Order matches aud_common_driver.c:377-384.
   */

  ret = aud_ana_write(BK7258_ANA_REG18, BK7258_ANA18_RESET_VALUE);
  if (ret >= 0)
    {
      ret = aud_ana_write(BK7258_ANA_REG19, BK7258_ANA19_RESET_VALUE);
    }

  if (ret >= 0)
    {
      ret = aud_ana_write(BK7258_ANA_REG20, BK7258_ANA20_RESET_VALUE);
    }

  if (ret >= 0)
    {
      ret = aud_ana_write(BK7258_ANA_REG21, BK7258_ANA21_RESET_VALUE);
    }

  if (ret >= 0)
    {
      ret = aud_ana_write(BK7258_ANA_REG27, BK7258_ANA27_RESET_VALUE);
    }

  if (ret >= 0)
    {
      ret = aud_ana_modify(BK7258_ANA_REG18, 0, BK7258_ANA18_ENAUDBIAS);
    }

  if (ret < 0)
    {
      auderr("analog register programming failed: %d\n", ret);
      (void)aud_pwc_request(false);
      return ret;
    }

  /* Start from a quiet block: nothing enabled, no interrupts, no
   * ADC-to-DAC loopback left over from a previous owner.
   */

  flags = enter_critical_section();

  modifyreg32(BK7258_AUD_CONFIG,
              BK7258_AUD_DAC_ENABLE | BK7258_AUD_ADC_ENABLE |
              BK7258_AUD_DTMF_ENABLE | BK7258_AUD_LINEIN_ENABLE |
              BK7258_AUD_DMIC_ENABLE, 0);

  modifyreg32(BK7258_AUD_FIFO_CONFIG,
              BK7258_AUD_DACL_INT_EN | BK7258_AUD_DACR_INT_EN |
              BK7258_AUD_ADC_INT_EN | BK7258_AUD_LOOP_ADC2DAC, 0);

  leave_critical_section(flags);

  if (!g_aud_irq_attached)
    {
      ret = irq_attach(BK7258_IRQ_AUDIO, bk7258_aud_isr, NULL);
      if (ret < 0)
        {
          auderr("irq_attach failed: %d\n", ret);
          (void)aud_pwc_request(false);
          return ret;
        }

      /* bk7258_irq.c routes external interrupts through CPU1's enable
       * registers, which is the core this image runs on, so this single
       * call is the whole story -- no SYSCTRL CPU0 bit to poke.
       */

      up_enable_irq(BK7258_IRQ_AUDIO);
      g_aud_irq_attached = true;
    }

  g_aud_initialized = true;

  audinfo("AUD ready, device id=0x%08" PRIx32 " version=0x%08" PRIx32 "\n",
          id, getreg32(BK7258_AUD_VERSION_ID));

  return OK;
}

int bk7258_aud_acquire(const void *owner)
{
  irqstate_t flags;
  int ret;
  if (owner == NULL) return -EINVAL;
  flags = enter_critical_section();
  ret = g_aud_owner == NULL ? OK : -EBUSY;
  if (ret == OK) g_aud_owner = owner;
  leave_critical_section(flags);
  return ret;
}

void bk7258_aud_release(const void *owner)
{
  irqstate_t flags = enter_critical_section();
  if (owner != NULL && g_aud_owner == owner) g_aud_owner = NULL;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: bk7258_aud_read_id / bk7258_aud_read_version
 ****************************************************************************/

uint32_t bk7258_aud_read_id(void)
{
  return getreg32(BK7258_AUD_DEVICE_ID);
}

uint32_t bk7258_aud_read_version(void)
{
  return getreg32(BK7258_AUD_VERSION_ID);
}

/****************************************************************************
 * Name: bk7258_aud_dac_setup
 ****************************************************************************/

int bk7258_aud_dac_setup(const struct bk7258_aud_config *cfg)
{
  irqstate_t flags;
  uint32_t setbits;
  int ret;

  if (cfg == NULL)
    {
      return -EINVAL;
    }

  if (cfg->dac_dig_gain > BK7258_AUD_DAC_DIG_GAIN_MAX ||
      cfg->dac_ana_gain > BK7258_AUD_DAC_ANA_GAIN_MAX)
    {
      return -EINVAL;
    }

  ret = bk7258_aud_initialize();
  if (ret < 0)
    {
      return ret;
    }

  ret = aud_clk_config(cfg->clksrc);
  if (ret < 0)
    {
      return ret;
    }

  /* Allow shutdown after partially completed setup. */

  g_aud_dac_ready = true;

  /* Analog DAC path.  aud_dac_driver.c:82-118 order: bias, driver, DC
   * offset cancellation, current source, then the channel enable.  The
   * board's AUDLP/AUDLN pair is differential, and the analog reset value
   * already has diffen set, but set it explicitly so the mode does not
   * depend on the reset value staying that way.
   */

  ret = aud_ana_modify(BK7258_ANA_REG21, 0, BK7258_ANA21_ENBS);
  if (ret >= 0)
    {
      ret = aud_ana_modify(BK7258_ANA_REG20, 0, BK7258_ANA20_DACDRVEN);
    }

  if (ret >= 0)
    {
      ret = aud_ana_modify(BK7258_ANA_REG20, 0, BK7258_ANA20_LENDCOC);
    }

  if (ret >= 0)
    {
      ret = aud_ana_modify(BK7258_ANA_REG21, 0, BK7258_ANA21_ENIDACL);
    }

  if (ret >= 0)
    {
      /* Enable the left channel only: BK7258's DAC right channel does not
       * exist (sys_hal_aud_dacr_en() is a "//not support" stub) and the
       * board is mono anyway.  Set differential mode, the analog gain and
       * start muted.
       */

      ret = aud_ana_modify(BK7258_ANA_REG20,
                           BK7258_ANA20_DACG_MASK,
                           BK7258_ANA20_DACLEN | BK7258_ANA20_DIFFEN |
                           BK7258_ANA20_DACMUTE |
                           ((uint32_t)cfg->dac_ana_gain <<
                            BK7258_ANA20_DACG_SHIFT));
    }

