open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
  if (ret < 0)
    {
      auderr("DAC analog setup failed: %d\n", ret);
      return ret;
    }

  flags = enter_critical_section();

  /* Digital gain, and bypass both high-pass filters as the vendor does
   * (aud_dac_driver.c:122-124).
   */

  setbits = ((uint32_t)cfg->dac_dig_gain << BK7258_AUD_DAC_GAIN_SHIFT) |
            BK7258_AUD_DAC_HPF1_BYPASS | BK7258_AUD_DAC_HPF2_BYPASS;

  modifyreg32(BK7258_AUD_DAC_CONFIG0,
              BK7258_AUD_DAC_GAIN_MASK | BK7258_AUD_DAC_CLK_INVERT,
              setbits);

  modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_DACL_RD_THRED_MASK,
              AUD_DACL_RD_THRESHOLD << BK7258_AUD_DACL_RD_THRED_SHIFT);

  leave_critical_section(flags);

  ret = aud_set_dac_samplerate(cfg->samplerate);
  if (ret < 0)
    {
      auderr("unsupported DAC sample rate %" PRIu32 "\n", cfg->samplerate);
      return ret;
    }

  g_aud_dac_ready = true;
  return OK;
}

/****************************************************************************
 * Name: bk7258_aud_dac_shutdown
 ****************************************************************************/

void bk7258_aud_dac_shutdown(void)
{
  if (!g_aud_dac_ready)
    {
      return;
    }

  bk7258_aud_dac_stop();
  bk7258_aud_tx_int_enable(false);
  bk7258_aud_dac_mute(true);

  (void)aud_ana_modify(BK7258_ANA_REG20,
                       BK7258_ANA20_DACLEN | BK7258_ANA20_DACDRVEN |
                       BK7258_ANA20_LENDCOC, 0);
  (void)aud_ana_modify(BK7258_ANA_REG21,
                       BK7258_ANA21_ENIDACL | BK7258_ANA21_ENBS, 0);

  g_aud_dac_ready = false;
}

/****************************************************************************
 * Name: bk7258_aud_dac_start / bk7258_aud_dac_stop
 ****************************************************************************/

void bk7258_aud_dac_start(void)
{
  modifyreg32(BK7258_AUD_CONFIG, 0, BK7258_AUD_DAC_ENABLE);
}

void bk7258_aud_dac_stop(void)
{
  modifyreg32(BK7258_AUD_CONFIG, BK7258_AUD_DAC_ENABLE, 0);
}

/****************************************************************************
 * Name: bk7258_aud_dac_mute
 ****************************************************************************/

int bk7258_aud_dac_mute(bool mute)
{
  if (mute)
    {
      return aud_ana_modify(BK7258_ANA_REG20, 0, BK7258_ANA20_DACMUTE);
    }
  else
    {
      return aud_ana_modify(BK7258_ANA_REG20, BK7258_ANA20_DACMUTE, 0);
    }
}

/****************************************************************************
 * Name: bk7258_aud_dac_set_dig_gain
 ****************************************************************************/

int bk7258_aud_dac_set_dig_gain(uint8_t gain)
{
  irqstate_t flags;

  if (gain > BK7258_AUD_DAC_DIG_GAIN_MAX)
    {
      return -EINVAL;
    }

  flags = enter_critical_section();
  modifyreg32(BK7258_AUD_DAC_CONFIG0, BK7258_AUD_DAC_GAIN_MASK,
              (uint32_t)gain << BK7258_AUD_DAC_GAIN_SHIFT);
  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: bk7258_aud_adc_setup
 ****************************************************************************/

int bk7258_aud_adc_setup(const struct bk7258_aud_config *cfg)
{
  irqstate_t flags;
  uint32_t micgain;
  int ret;

  if (cfg == NULL)
    {
      return -EINVAL;
    }

  if (cfg->adc_gain > BK7258_AUD_ADC_GAIN_MAX ||
      cfg->mic_gain > BK7258_AUD_MIC_GAIN_MAX)
    {
      return -EINVAL;
    }

  ret = bk7258_aud_initialize();
  if (ret < 0)
    {
      return ret;
    }

  ret = aud_clk_config(cfg->clksrc);
  if (ret < 0)
    {
      return ret;
    }

  g_aud_adc_ready = true;
  micgain = (uint32_t)cfg->mic_gain << BK7258_ANA_MIC_GAIN_SHIFT;

  /* MIC1 is the real microphone and is always enabled.  MIC2 carries the
   * post-amplifier echo reference; enabling it makes the ADC FIFO word
   * carry a full L/R frame instead of just L.
   */

  ret = aud_ana_modify(BK7258_ANA_REG19, BK7258_ANA_MIC_GAIN_MASK,
                       BK7258_ANA_MIC_EN | micgain);

  if (ret >= 0)
    {
      if (cfg->capture_reference)
        {
          ret = aud_ana_modify(BK7258_ANA_REG27, BK7258_ANA_MIC_GAIN_MASK,
                               BK7258_ANA_MIC_EN | micgain);
        }
      else
        {
          ret = aud_ana_modify(BK7258_ANA_REG27, BK7258_ANA_MIC_EN, 0);
        }
    }

  /* ADC and MIC bias.  micbias is a single global enable shared by both
   * channels (ana_reg18 bit 5), which is harmless here: the schematic
   * feeds MICBIAS to MIC1 only, through R66/R67, while the MIC2 echo tap
   * is DC-blocked by C60/C61 (1uF), so the reference channel's operating
   * point is unaffected.
   */

  if (ret >= 0)
    {
      ret = aud_ana_modify(BK7258_ANA_REG18, 0,
                           BK7258_ANA18_ENAUDBIAS |
                           BK7258_ANA18_ENADCBIAS |
                           BK7258_ANA18_ENMICBIAS);
    }

  if (ret < 0)
    {
      auderr("ADC analog setup failed: %d\n", ret);
      return ret;
    }

  /* Reset the MIC front-end after its parameters are in place, mirroring
   * aud_adc_driver.c:108-111.  Both channels get the pulse so MIC2 comes
   * out of reset together with MIC1 when it is in use.
   */

  ret = aud_ana_modify(BK7258_ANA_REG19, 0, BK7258_ANA_MIC_RST);
  if (ret >= 0 && cfg->capture_reference)
    {
      ret = aud_ana_modify(BK7258_ANA_REG27, 0, BK7258_ANA_MIC_RST);
    }

  if (ret < 0) return ret;

  up_udelay(100);

  ret = aud_ana_modify(BK7258_ANA_REG19, BK7258_ANA_MIC_RST, 0);
  if (ret >= 0 && cfg->capture_reference)
    {
      ret = aud_ana_modify(BK7258_ANA_REG27, BK7258_ANA_MIC_RST, 0);
    }

  if (ret < 0) return ret;

  flags = enter_critical_section();

  /* The two bypass bits join the clear mask so they can be turned off.
   * Previously they were only ever set, which made the high-pass stages
   * unreachable no matter what a caller asked for.
   */

  modifyreg32(BK7258_AUD_ADC_CONFIG0,
              BK7258_AUD_ADC_GAIN_MASK | BK7258_AUD_ADC_SAMPLE_EDGE |
              BK7258_AUD_ADC_DIG_MIC_SEL |
              BK7258_AUD_ADC_HPF1_BYPASS | BK7258_AUD_ADC_HPF2_BYPASS,
              ((uint32_t)cfg->adc_gain << BK7258_AUD_ADC_GAIN_SHIFT) |
              (cfg->adc_hpf ? 0 : (BK7258_AUD_ADC_HPF1_BYPASS |
                                   BK7258_AUD_ADC_HPF2_BYPASS)));

  modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_ADC_WR_THRED_MASK,
              AUD_ADC_WR_THRESHOLD << BK7258_AUD_ADC_WR_THRED_SHIFT);

  leave_critical_section(flags);

  ret = aud_set_adc_samplerate(cfg->samplerate);
  if (ret < 0)
    {
      auderr("unsupported ADC sample rate %" PRIu32 "\n", cfg->samplerate);
      return ret;
    }

