open-vela/nuttx/arch/arm/src/bk7258/bk7258_aud.c
  g_aud_capture_reference = cfg->capture_reference;
  g_aud_adc_ready = true;
  return OK;
}

/****************************************************************************
 * Name: bk7258_aud_adc_shutdown
 ****************************************************************************/

void bk7258_aud_adc_shutdown(void)
{
  if (!g_aud_adc_ready)
    {
      return;
    }

  bk7258_aud_adc_stop();
  bk7258_aud_rx_int_enable(false);

  (void)aud_ana_modify(BK7258_ANA_REG19, BK7258_ANA_MIC_EN, 0);
  (void)aud_ana_modify(BK7258_ANA_REG27, BK7258_ANA_MIC_EN, 0);
  (void)aud_ana_modify(BK7258_ANA_REG18,
                       BK7258_ANA18_ENADCBIAS | BK7258_ANA18_ENMICBIAS, 0);

  g_aud_capture_reference = false;
  g_aud_adc_ready = false;
}

/****************************************************************************
 * Name: bk7258_aud_adc_start / bk7258_aud_adc_stop
 ****************************************************************************/

void bk7258_aud_adc_start(void)
{
  modifyreg32(BK7258_AUD_CONFIG, 0, BK7258_AUD_ADC_ENABLE);
}

void bk7258_aud_adc_stop(void)
{
  modifyreg32(BK7258_AUD_CONFIG, BK7258_AUD_ADC_ENABLE, 0);
}

/****************************************************************************
 * Name: bk7258_aud_set_callbacks
 ****************************************************************************/

void bk7258_aud_set_tx_callback(bk7258_aud_xfer_cb_t cb, void *arg)
{
  irqstate_t flags = enter_critical_section();

  g_aud_tx_cb = cb;
  g_aud_tx_arg = arg;

  leave_critical_section(flags);
}

void bk7258_aud_set_rx_callback(bk7258_aud_xfer_cb_t cb, void *arg)
{
  irqstate_t flags = enter_critical_section();

  g_aud_rx_cb = cb;
  g_aud_rx_arg = arg;

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: bk7258_aud_dac_write
 ****************************************************************************/

unsigned int bk7258_aud_dac_write(const int16_t *samples,
                                  unsigned int nsamples)
{
  unsigned int written = 0;

  if (samples == NULL)
    {
      return 0;
    }

  while (written < nsamples)
    {
      if ((getreg32(BK7258_AUD_FIFO_STATUS) &
           BK7258_AUD_DACL_FIFO_FULL) != 0)
        {
          break;
        }

      /* Mono: duplicate the sample into both halves so the word is well
       * defined even though the right DAC does not exist on BK7258.
       */

      putreg32(((uint32_t)(uint16_t)samples[written] <<
                BK7258_AUD_FIFO_L_SHIFT) |
               ((uint32_t)(uint16_t)samples[written] <<
                BK7258_AUD_FIFO_R_SHIFT),
               BK7258_AUD_DAC_FIFO_PORT);

      written++;
    }

  return written;
}

/****************************************************************************
 * Name: bk7258_aud_adc_read
 ****************************************************************************/

unsigned int bk7258_aud_adc_read(int16_t *samples, unsigned int nsamples)
{
  unsigned int read = 0;
  unsigned int step;
  uint32_t word;

  if (samples == NULL)
    {
      return 0;
    }

  /* One FIFO word carries L in [15:0] and R in [31:16].  With the echo
   * reference enabled both halves are consumed, so the caller sees
   * interleaved L,R pairs; otherwise only L is stored.
   */

  step = g_aud_capture_reference ? 2 : 1;

  while (read + step <= nsamples)
    {
      if ((getreg32(BK7258_AUD_FIFO_STATUS) &
           BK7258_AUD_ADC_FIFO_EMPTY) != 0)
        {
          break;
        }

      word = getreg32(BK7258_AUD_ADC_FIFO_PORT);

      samples[read++] = (int16_t)((word >> BK7258_AUD_FIFO_L_SHIFT) &
                                 BK7258_AUD_FIFO_SAMPLE_MASK);

      if (step == 2)
        {
          samples[read++] = (int16_t)((word >> BK7258_AUD_FIFO_R_SHIFT) &
                                      BK7258_AUD_FIFO_SAMPLE_MASK);
        }
    }

  return read;
}

/****************************************************************************
 * Name: bk7258_aud_tx_int_enable / bk7258_aud_rx_int_enable
 ****************************************************************************/

void bk7258_aud_tx_int_enable(bool enable)
{
  irqstate_t flags = enter_critical_section();

  if (enable)
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, 0, BK7258_AUD_DACL_INT_EN);
    }
  else
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_DACL_INT_EN, 0);
    }

  leave_critical_section(flags);
}

void bk7258_aud_rx_int_enable(bool enable)
{
  irqstate_t flags = enter_critical_section();

  if (enable)
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, 0, BK7258_AUD_ADC_INT_EN);
    }
  else
    {
      modifyreg32(BK7258_AUD_FIFO_CONFIG, BK7258_AUD_ADC_INT_EN, 0);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: bk7258_aud_fifo_status
 ****************************************************************************/

uint32_t bk7258_aud_fifo_status(void)
{
  return getreg32(BK7258_AUD_FIFO_STATUS);
}

uint32_t bk7258_aud_adc_threshold(void)
{
  return (getreg32(BK7258_AUD_FIFO_CONFIG) &
          BK7258_AUD_ADC_WR_THRED_MASK) >> BK7258_AUD_ADC_WR_THRED_SHIFT;
}

#endif /* CONFIG_BK7258_AUDIO */
